// pages/notice/notice.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    displaylist:[
      {
        title: "震惊！某女子居然在森林与猴子做这种事！",
        date: '2018-05-16'
      },
      {
        title: "【兄贵】漂♂移",
        date: '2017-11-02'
      },
      {
        title: "【饥荒海难隐藏设定】物品复制BUG",
        date: '2018-03-08'
      },
      {
        title: "各位亲爱的up主，非常抱歉由于数据统计故障，创作中心的数据展示出现了部分异常。攻城狮们正在紧急修复中，预计今天下午3:00可以恢复展示，还请各位谅解。",
        date: '2018-03-02'
      },
      {
        title: "各位亲爱的up主，非常抱歉由于数据统计故障，创作中心的数据展示出现了部分异常。攻城狮们正在紧急修复中，预计今天下午3:00可以恢复展示，还请各位谅解。",
        date: '2018-03-02'
      },
      {
        title: "各位亲爱的up主，非常抱歉由于数据统计故障，创作中心的数据展示出现了部分异常。攻城狮们正在紧急修复中，预计今天下午3:00可以恢复展示，还请各位谅解。",
        date: '2018-03-02'
      },
      {
        title: "各位亲爱的up主，非常抱歉由于数据统计故障，创作中心的数据展示出现了部分异常。攻城狮们正在紧急修复中，预计今天下午3:00可以恢复展示，还请各位谅解。",
        date: '2018-03-02'
      },
      {
        title: "各位亲爱的up主，非常抱歉由于数据统计故障，创作中心的数据展示出现了部分异常。攻城狮们正在紧急修复中，预计今天下午3:00可以恢复展示，还请各位谅解。",
        date: '2018-03-02'
      },
      {
        title: "各位亲爱的up主，非常抱歉由于数据统计故障，创作中心的数据展示出现了部分异常。攻城狮们正在紧急修复中，预计今天下午3:00可以恢复展示，还请各位谅解。",
        date: '2018-03-02'
      },
      {
        title: "各位亲爱的up主，非常抱歉由于数据统计故障，创作中心的数据展示出现了部分异常。攻城狮们正在紧急修复中，预计今天下午3:00可以恢复展示，还请各位谅解。",
        date: '2018-03-02'
      },
      {
        title: "各位亲爱的up主，非常抱歉由于数据统计故障，创作中心的数据展示出现了部分异常。攻城狮们正在紧急修复中，预计今天下午3:00可以恢复展示，还请各位谅解。",
        date: '2018-03-02'
      },
      {
        title: "各位亲爱的up主，非常抱歉由于数据统计故障，创作中心的数据展示出现了部分异常。攻城狮们正在紧急修复中，预计今天下午3:00可以恢复展示，还请各位谅解。",
        date: '2018-03-02'
      },
      {
        title: "各位亲爱的up主，非常抱歉由于数据统计故障，创作中心的数据展示出现了部分异常。攻城狮们正在紧急修复中，预计今天下午3:00可以恢复展示，还请各位谅解。",
        date: '2018-03-02'
      }
    ],
    isLoading: false
  },

  lower: function(e){
    this.setData({
      isLoading: true
    });
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})